app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "TFlan's Birthday"], ["user_id", 1], ["created_at", "2016-03-09 05:17:34.953599"], ["updated_at", "2016-03-09 05:17:34.953599"]]
---
	def create
		@micropost = current_user.microposts.build(micropost_params)
		if @micropost.save